pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxCpu_bf.h
/**
 * \file IfxCpu_bf.h
 * \brief
 * \copyright Copyright (c) 2020 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC33XED_UM_V1.4.0.R0
 * Specification: TC3xx User Manual.V1.4.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Cpu_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Cpu_Registers
 * 
 */
#ifndef IFXCPU_BF_H
#define IFXCPU_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Cpu_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_CPU_FLASHCON0_Bits.TAG1 */
#define IFX_CPU_FLASHCON0_TAG1_LEN (6u)

/** \brief Mask for Ifx_CPU_FLASHCON0_Bits.TAG1 */
#define IFX_CPU_FLASHCON0_TAG1_MSK (0x3fu)

/** \brief Offset for Ifx_CPU_FLASHCON0_Bits.TAG1 */
#define IFX_CPU_FLASHCON0_TAG1_OFF (0u)

/** \brief Length for Ifx_CPU_FLASHCON0_Bits.TAG2 */
#define IFX_CPU_FLASHCON0_TAG2_LEN (6u)

/** \brief Mask for Ifx_CPU_FLASHCON0_Bits.TAG2 */
#define IFX_CPU_FLASHCON0_TAG2_MSK (0x3fu)

/** \brief Offset for Ifx_CPU_FLASHCON0_Bits.TAG2 */
#define IFX_CPU_FLASHCON0_TAG2_OFF (8u)

/** \brief Length for Ifx_CPU_FLASHCON0_Bits.TAG3 */
#define IFX_CPU_FLASHCON0_TAG3_LEN (6u)

/** \brief Mask for Ifx_CPU_FLASHCON0_Bits.TAG3 */
#define IFX_CPU_FLASHCON0_TAG3_MSK (0x3fu)

/** \brief Offset for Ifx_CPU_FLASHCON0_Bits.TAG3 */
#define IFX_CPU_FLASHCON0_TAG3_OFF (16u)

/** \brief Length for Ifx_CPU_FLASHCON0_Bits.TAG4 */
#define IFX_CPU_FLASHCON0_TAG4_LEN (6u)

/** \brief Mask for Ifx_CPU_FLASHCON0_Bits.TAG4 */
#define IFX_CPU_FLASHCON0_TAG4_MSK (0x3fu)

/** \brief Offset for Ifx_CPU_FLASHCON0_Bits.TAG4 */
#define IFX_CPU_FLASHCON0_TAG4_OFF (24u)

/** \brief Length for Ifx_CPU_FLASHCON1_Bits.STALL */
#define IFX_CPU_FLASHCON1_STALL_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON1_Bits.STALL */
#define IFX_CPU_FLASHCON1_STALL_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON1_Bits.STALL */
#define IFX_CPU_FLASHCON1_STALL_OFF (0u)

/** \brief Length for Ifx_CPU_FLASHCON1_Bits.MASKUECC */
#define IFX_CPU_FLASHCON1_MASKUECC_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON1_Bits.MASKUECC */
#define IFX_CPU_FLASHCON1_MASKUECC_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON1_Bits.MASKUECC */
#define IFX_CPU_FLASHCON1_MASKUECC_OFF (16u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.RECDIS */
#define IFX_CPU_FLASHCON2_RECDIS_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.RECDIS */
#define IFX_CPU_FLASHCON2_RECDIS_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.RECDIS */
#define IFX_CPU_FLASHCON2_RECDIS_OFF (0u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.ECCCORDIS */
#define IFX_CPU_FLASHCON2_ECCCORDIS_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.ECCCORDIS */
#define IFX_CPU_FLASHCON2_ECCCORDIS_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.ECCCORDIS */
#define IFX_CPU_FLASHCON2_ECCCORDIS_OFF (2u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.HMARGIN */
#define IFX_CPU_FLASHCON2_HMARGIN_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.HMARGIN */
#define IFX_CPU_FLASHCON2_HMARGIN_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.HMARGIN */
#define IFX_CPU_FLASHCON2_HMARGIN_OFF (8u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.MSEL */
#define IFX_CPU_FLASHCON2_MSEL_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.MSEL */
#define IFX_CPU_FLASHCON2_MSEL_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.MSEL */
#define IFX_CPU_FLASHCON2_MSEL_OFF (10u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.ECCSCLR */
#define IFX_CPU_FLASHCON2_ECCSCLR_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.ECCSCLR */
#define IFX_CPU_FLASHCON2_ECCSCLR_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.ECCSCLR */
#define IFX_CPU_FLASHCON2_ECCSCLR_OFF (16u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.SBABCLR */
#define IFX_CPU_FLASHCON2_SBABCLR_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.SBABCLR */
#define IFX_CPU_FLASHCON2_SBABCLR_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.SBABCLR */
#define IFX_CPU_FLASHCON2_SBABCLR_OFF (24u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.DBABCLR */
#define IFX_CPU_FLASHCON2_DBABCLR_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.DBABCLR */
#define IFX_CPU_FLASHCON2_DBABCLR_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.DBABCLR */
#define IFX_CPU_FLASHCON2_DBABCLR_OFF (26u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.MBABCLR */
#define IFX_CPU_FLASHCON2_MBABCLR_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.MBABCLR */
#define IFX_CPU_FLASHCON2_MBABCLR_MSK (0x3u)

