pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxCpu_bf.h
/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN2 */
#define IFX_CPU_RGN_ACCENA_EN2_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN2 */
#define IFX_CPU_RGN_ACCENA_EN2_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN2 */
#define IFX_CPU_RGN_ACCENA_EN2_OFF (2u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN3 */
#define IFX_CPU_RGN_ACCENA_EN3_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN3 */
#define IFX_CPU_RGN_ACCENA_EN3_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN3 */
#define IFX_CPU_RGN_ACCENA_EN3_OFF (3u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN4 */
#define IFX_CPU_RGN_ACCENA_EN4_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN4 */
#define IFX_CPU_RGN_ACCENA_EN4_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN4 */
#define IFX_CPU_RGN_ACCENA_EN4_OFF (4u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN5 */
#define IFX_CPU_RGN_ACCENA_EN5_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN5 */
#define IFX_CPU_RGN_ACCENA_EN5_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN5 */
#define IFX_CPU_RGN_ACCENA_EN5_OFF (5u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN6 */
#define IFX_CPU_RGN_ACCENA_EN6_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN6 */
#define IFX_CPU_RGN_ACCENA_EN6_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN6 */
#define IFX_CPU_RGN_ACCENA_EN6_OFF (6u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN7 */
#define IFX_CPU_RGN_ACCENA_EN7_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN7 */
#define IFX_CPU_RGN_ACCENA_EN7_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN7 */
#define IFX_CPU_RGN_ACCENA_EN7_OFF (7u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN8 */
#define IFX_CPU_RGN_ACCENA_EN8_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN8 */
#define IFX_CPU_RGN_ACCENA_EN8_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN8 */
#define IFX_CPU_RGN_ACCENA_EN8_OFF (8u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN9 */
#define IFX_CPU_RGN_ACCENA_EN9_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN9 */
#define IFX_CPU_RGN_ACCENA_EN9_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN9 */
#define IFX_CPU_RGN_ACCENA_EN9_OFF (9u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN10 */
#define IFX_CPU_RGN_ACCENA_EN10_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN10 */
#define IFX_CPU_RGN_ACCENA_EN10_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN10 */
#define IFX_CPU_RGN_ACCENA_EN10_OFF (10u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN11 */
#define IFX_CPU_RGN_ACCENA_EN11_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN11 */
#define IFX_CPU_RGN_ACCENA_EN11_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN11 */
#define IFX_CPU_RGN_ACCENA_EN11_OFF (11u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN12 */
#define IFX_CPU_RGN_ACCENA_EN12_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN12 */
#define IFX_CPU_RGN_ACCENA_EN12_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN12 */
#define IFX_CPU_RGN_ACCENA_EN12_OFF (12u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN13 */
#define IFX_CPU_RGN_ACCENA_EN13_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN13 */
#define IFX_CPU_RGN_ACCENA_EN13_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN13 */
#define IFX_CPU_RGN_ACCENA_EN13_OFF (13u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN14 */
#define IFX_CPU_RGN_ACCENA_EN14_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN14 */
#define IFX_CPU_RGN_ACCENA_EN14_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN14 */
#define IFX_CPU_RGN_ACCENA_EN14_OFF (14u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN15 */
#define IFX_CPU_RGN_ACCENA_EN15_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN15 */
#define IFX_CPU_RGN_ACCENA_EN15_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN15 */
#define IFX_CPU_RGN_ACCENA_EN15_OFF (15u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN16 */
#define IFX_CPU_RGN_ACCENA_EN16_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN16 */
#define IFX_CPU_RGN_ACCENA_EN16_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN16 */
#define IFX_CPU_RGN_ACCENA_EN16_OFF (16u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN17 */
#define IFX_CPU_RGN_ACCENA_EN17_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN17 */
#define IFX_CPU_RGN_ACCENA_EN17_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN17 */
#define IFX_CPU_RGN_ACCENA_EN17_OFF (17u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN18 */
#define IFX_CPU_RGN_ACCENA_EN18_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN18 */
#define IFX_CPU_RGN_ACCENA_EN18_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN18 */
#define IFX_CPU_RGN_ACCENA_EN18_OFF (18u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN19 */
#define IFX_CPU_RGN_ACCENA_EN19_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN19 */
#define IFX_CPU_RGN_ACCENA_EN19_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN19 */
#define IFX_CPU_RGN_ACCENA_EN19_OFF (19u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN20 */
#define IFX_CPU_RGN_ACCENA_EN20_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN20 */
#define IFX_CPU_RGN_ACCENA_EN20_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN20 */
#define IFX_CPU_RGN_ACCENA_EN20_OFF (20u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN21 */
#define IFX_CPU_RGN_ACCENA_EN21_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN21 */
#define IFX_CPU_RGN_ACCENA_EN21_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN21 */
#define IFX_CPU_RGN_ACCENA_EN21_OFF (21u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN22 */
#define IFX_CPU_RGN_ACCENA_EN22_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN22 */
#define IFX_CPU_RGN_ACCENA_EN22_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN22 */
#define IFX_CPU_RGN_ACCENA_EN22_OFF (22u)

